
&НаКлиенте
Процедура СписокДат2ПриАктивизацииЯчейки(Элемент)
	Элементы.СписокДат2.ВыделенныеСтроки.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ВыберитеДату(Команда)
	Если Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ПослеВыбораСпециализации тогда
		ЗагрузитьДатыПоСпециализации();
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборДатыПоСпециализации;	
	Иначе	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДатыПоСпециализации()
	ТЗ=РаботаСРасписанием.ПолучитьДатыПоСпециализации(Объект.Пациент.Поликлиника,Специализация);
	Если ТЗ.Количество()=0 тогда
		СписокДат.Очистить();
		Возврат;	
	КонецЕсли;
	СписокДат.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура СписокСпециализаций1ПриАктивизацииЯчейки(Элемент)
	Элементы.СписокСпециализаций1.ВыделенныеСтроки.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ВыберитеНаправление(Команда)
	ЗагрузитьСпециализации();
	Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.СписокСпециализаций;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСпециализации()
	ТЗ=РаботаСРасписанием.ПолучитьСписокСпециализацийПоликлиники(Объект.Пациент.Поликлиника);
	Если ТЗ.Количество()=0 тогда
		СписокСпециализаций.Очистить();
		Возврат;	
	КонецЕсли;
	СписокСпециализаций.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Специализация"));
КонецПроцедуры

&НаКлиенте
Процедура Войти(Команда)
	Объект.Пациент=РаботаСРасписанием.НайтиПациентаПоСНИЛС(СНИЛС);
	ДополнитьОбъект();
	Если НЕ Объект.Пациент.Пустая() тогда
		//Элементы.Кнопки.Видимость=Истина;
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборДействия;
	Иначе
		Сообщить("Не удалось найти пациента!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнитьОбъект()
	Объект.Поликлиника=Объект.Пациент.Поликлиника;
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	ВывестиВрачей();
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ВывестиВрачей(-1);	
КонецПроцедуры

&НаКлиенте
Процедура Записаться(Команда)
	Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ЗаписьНаПрием;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПосещения(Команда)
	Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ИсторияПосещений;
	ЗагрузитьИсториюПосещений();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИсториюПосещений()
	ТЗ=РаботаСРасписанием.ПолучитьСписокПоследнихВрачейПоПациенту(Объект.Пациент);
	Если ТЗ.Количество()=0 тогда
		ИсторияПосещений.Очистить();
	Иначе
		ИсторияПосещений.Загрузить(ТЗ);	
	КонецЕсли;
	ТекНомерВрача=1;
	ВывестиВрачей(,Истина);
КонецПроцедуры

&НаСервере
Процедура ВывестиВрачей(Направление=1,ПервыйЗапуск=Ложь)
	Если Направление=1 тогда
		Если не ПервыйЗапуск тогда
			ТекНомерВрача=5;
		КонецЕсли;
		Если ТекНомерВрача>ИсторияПосещений.Количество() тогда
			возврат;
		Иначе
			ТекНомерВрача=Макс(ТекНомерВрача,1);
		КонецЕсли;
		Врач1="";
		Врач2="";
		Врач3="";
		Врач4="";
		ВремяПриема1="";
		ВремяПриема2="";
		ВремяПриема3="";
		ВремяПриема4="";
		ДатаПриема1="";
		ДатаПриема2="";
		ДатаПриема3="";
		ДатаПриема4="";
		Кабинет1="";
		Кабинет2="";
		Кабинет3="";
		Кабинет4="";
		СсылкаНаКартинку1="";
		СсылкаНаКартинку2="";
		СсылкаНаКартинку3="";
		СсылкаНаКартинку4="";
		Для н=ТекНомерВрача по Мин(ТекНомерВрача+3,ИсторияПосещений.Количество()) цикл
			Текстрока=ИсторияПосещений[н-1];
			Если н=4 тогда
				ТекЭлемент=н;
			Иначе
				ТекЭлемент=Цел(н/4);
			КонецЕсли;
			Если ТекЭлемент<1 тогда
				ТекЭлемент=н;
			КонецЕсли;
			Если ТекЭлемент=1 тогда
				Врач1=Текстрока.Врач;
				ВремяПриема1=Текстрока.ВремяПриема;
				ДатаПриема1=Текстрока.ДатаПриема;
				Кабинет1=Текстрока.Кабинет;
				СсылкаНаКартинку1=ПолучитьНавигационнуюСсылку(Врач1, "Фото");
			ИначеЕсли ТекЭлемент=2 тогда
				Врач2=Текстрока.Врач;
				ВремяПриема2=Текстрока.ВремяПриема;
				ДатаПриема2=Текстрока.ДатаПриема;
				Кабинет2=Текстрока.Кабинет;
				СсылкаНаКартинку2=ПолучитьНавигационнуюСсылку(Врач2, "Фото");
			ИначеЕсли ТекЭлемент=3 тогда
				Врач3=Текстрока.Врач;
				ВремяПриема3=Текстрока.ВремяПриема;
				ДатаПриема3=Текстрока.ДатаПриема;
				Кабинет3=Текстрока.Кабинет;
				СсылкаНаКартинку3=ПолучитьНавигационнуюСсылку(Врач3, "Фото");
			ИначеЕсли ТекЭлемент=4 тогда
				Врач4=Текстрока.Врач;
				ВремяПриема4=Текстрока.ВремяПриема;
				ДатаПриема4=Текстрока.ДатаПриема;
				Кабинет4=Текстрока.Кабинет;
				СсылкаНаКартинку4=ПолучитьНавигационнуюСсылку(Врач4, "Фото");
			КонецЕсли;
		КонецЦикла;
		ТекНомерВрача=ТекНомерВрача+4;
	Иначе
		Если ТекНомерВрача<1 тогда
			возврат;
		КонецЕсли;
		ТекНомерВрача=Мин(ТекНомерВрача,ИсторияПосещений.Количество())-1;
		Врач1="";
		Врач2="";
		Врач3="";
		Врач4="";
		ВремяПриема1="";
		ВремяПриема2="";
		ВремяПриема3="";
		ВремяПриема4="";
		ДатаПриема1="";
		ДатаПриема2="";
		ДатаПриема3="";
		ДатаПриема4="";
		Кабинет1="";
		Кабинет2="";
		Кабинет3="";
		Кабинет4="";
		СсылкаНаКартинку1="";
		СсылкаНаКартинку2="";
		СсылкаНаКартинку3="";
		СсылкаНаКартинку4="";
		Счетчик=4;
		н=ТекНомерВрача;
		Пока Счетчик>0 цикл
			Текстрока=ИсторияПосещений[ТекНомерВрача-1];
			Если Счетчик=1 тогда
				Врач1=Текстрока.Врач;
				ВремяПриема1=Текстрока.ВремяПриема;
				ДатаПриема1=Текстрока.ДатаПриема;
				Кабинет1=Текстрока.Кабинет;
				СсылкаНаКартинку1=ПолучитьНавигационнуюСсылку(Врач1, "Фото");
			ИначеЕсли Счетчик=2 тогда
				Врач2=Текстрока.Врач;
				ВремяПриема2=Текстрока.ВремяПриема;
				ДатаПриема2=Текстрока.ДатаПриема;
				Кабинет2=Текстрока.Кабинет;
				СсылкаНаКартинку2=ПолучитьНавигационнуюСсылку(Врач2, "Фото");
			ИначеЕсли Счетчик=3 тогда
				Врач3=Текстрока.Врач;
				ВремяПриема3=Текстрока.ВремяПриема;
				ДатаПриема3=Текстрока.ДатаПриема;
				Кабинет3=Текстрока.Кабинет;
				СсылкаНаКартинку3=ПолучитьНавигационнуюСсылку(Врач3, "Фото");
			ИначеЕсли Счетчик=4 тогда
				Врач4=Текстрока.Врач;
				ВремяПриема4=Текстрока.ВремяПриема;
				ДатаПриема4=Текстрока.ДатаПриема;
				Кабинет4=Текстрока.Кабинет;
				СсылкаНаКартинку4=ПолучитьНавигационнуюСсылку(Врач4, "Фото");
			КонецЕсли;
			Счетчик=Счетчик-1;
			ТекНомерВрача=ТекНомерВрача-1;
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МоиРецепты(Команда)
	Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.СписокРецептов;
	ЗагрузитьСписокРецептов();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокРецептов()
	ТЗ=РаботаСРасписанием.ПолучитьРецептыПациента(Объект.Пациент);
	Если ТЗ.Количество()=0 тогда
		СписокРецептов.Очистить();
		Возврат;	
	КонецЕсли;
	СписокРецептов.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Рецепт"));
КонецПроцедуры

&НаКлиенте
Процедура СНИЛСПриИзменении(Элемент)
	Войти(Команды.Найти("Войти"));
КонецПроцедуры

&НаКлиенте
Процедура Вернуться(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокРецептов1ПриАктивизацииСтроки(Элемент)
	 //Элементы.СписокРецептов1.ВыделенныеСтроки.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СписокРецептов1ПриАктивизацииЯчейки(Элемент)
	Элементы.СписокРецептов1.ВыделенныеСтроки.Очистить();	
КонецПроцедуры

&НаКлиенте
Процедура СписокРецептов1ВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокРецептов1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;	
	Рецепт=Элементы.СписокРецептов1.ТекущиеДанные.Значение;
	ЗагрузитьЛекарства(Рецепт);
	Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.СписокЛекарств;
	Элементы.Декорация5.Заголовок="Скидка действует до: "+Формат(ПолучитьДатуСкидки(Рецепт),"ДФ=dd.MM.yyyy");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуСкидки(Рецепт)
	Возврат КонецДня(Рецепт.Дата+60*60*24*5);
КонецФункции

&НаКлиенте
Процедура СписокЛекарств1ПриАктивизацииЯчейки(Элемент)
	Элементы.СписокЛекарств1.ВыделенныеСтроки.Очистить();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЛекарства(Рецепт)
	ТЗ=РаботаСРасписанием.ПолучитьДанныеРецепта(Рецепт);
	Если ТЗ.Количество()=0 тогда
		СписокЛекарств.Очистить();
		Возврат;	
	КонецЕсли;
	СписокЛекарств.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Лекарство"));
КонецПроцедуры

&НаКлиенте
Процедура КупитьНабор(Команда)
	ЗагрузитьАптеки(Рецепт);
	Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.СписокАптек;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьАптеки(Рецепт)
	ТЗ=РаботаСРасписанием.ПолучитьЛучшиеЦеныПокупкиРецепта(Рецепт);
	Если ТЗ.Количество()=0 тогда
		РейтингАптек.Очистить();
		Возврат;	
	КонецЕсли;
	РейтингАптек.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура СписокАптек1ПриАктивизацииЯчейки(Элемент)
	Элементы.СписокАптек1.ВыделенныеСтроки.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаКартинку1Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ИсторияПосещений тогда
		ОткрытьВрача(Врач1);
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.КарточкаВрача;
	ИначеЕсли Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборВремениПосещения тогда
		Врач=Врач1;
		СсылкаНаКартинку_Врач=ПолучитьНавигационнуюСсылку(Врач, "Фото");
		ВремяПриема=ВремяПриема1;
		ДатаПриема=ДатаПриема1;
		Кабинет=Кабинет1;
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ПодтверждениеЗаписи;
	ИначеЕсли Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборВрачаПоСпециализации тогда
		Врач=Врач1;
		ЗагрузитьДатыПоВрачу();
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборДатыПоСпециализацииИВрачу;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаКартинку2Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ИсторияПосещений тогда
		ОткрытьВрача(Врач2);
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.КарточкаВрача;
	ИначеЕсли Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборВремениПосещения тогда
		Врач=Врач2;
		СсылкаНаКартинку_Врач=ПолучитьНавигационнуюСсылку(Врач, "Фото");
		ВремяПриема=ВремяПриема2;
		ДатаПриема=ДатаПриема2;
		Кабинет=Кабинет2;
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ПодтверждениеЗаписи;
	ИначеЕсли Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборВрачаПоСпециализации тогда
		Врач=Врач2;
		ЗагрузитьДатыПоВрачу();
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборДатыПоСпециализацииИВрачу;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаКартинку3Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ИсторияПосещений тогда
		ОткрытьВрача(Врач3);
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.КарточкаВрача;
	ИначеЕсли Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборВремениПосещения тогда
		Врач=Врач3;
		СсылкаНаКартинку_Врач=ПолучитьНавигационнуюСсылку(Врач, "Фото");
		ВремяПриема=ВремяПриема3;
		ДатаПриема=ДатаПриема3;
		Кабинет=Кабинет3;
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ПодтверждениеЗаписи;
	ИначеЕсли Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборВрачаПоСпециализации тогда
		Врач=Врач3;
		ЗагрузитьДатыПоВрачу();
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборДатыПоСпециализацииИВрачу;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаКартинку4Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ИсторияПосещений тогда
		ОткрытьВрача(Врач4);
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.КарточкаВрача;
	ИначеЕсли Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборВремениПосещения тогда
		Врач=Врач4;
		СсылкаНаКартинку_Врач=ПолучитьНавигационнуюСсылку(Врач, "Фото");
		ВремяПриема=ВремяПриема4;
		ДатаПриема=ДатаПриема4;          
		Кабинет=Кабинет4;
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ПодтверждениеЗаписи;
	ИначеЕсли Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборВрачаПоСпециализации тогда
		Врач=Врач4;
		ЗагрузитьДатыПоВрачу();
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборДатыПоСпециализацииИВрачу;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДатыПоВрачу()
	ТЗ=РаботаСРасписанием.ПолучитьДатыПриемаВрача(Объект.Пациент.Поликлиника,Врач);
	Если ТЗ.Количество()=0 тогда
		СписокДат.Очистить();
		Возврат;	
	КонецЕсли;
	СписокДат.Загрузить(ТЗ);
КонецПроцедуры

&НаСервере
Процедура ОткрытьВрача(ВыбВрач);
	Врач=ВыбВрач; 
	СсылкаНаКартинку_Врач=ПолучитьНавигационнуюСсылку(Врач, "Фото");
КонецПроцедуры

&НаКлиенте
Процедура СписокСпециализаций1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;	
	Специализация=Элементы.СписокСпециализаций1.ТекущиеДанные.Значение;
	Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ПослеВыбораСпециализации;
КонецПроцедуры

&НаКлиенте
Процедура СписокДат1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ВыбДата=Элементы.СписокДат1.ТекущиеДанные.Значение;
	ДатаПриема=ВыбДата;
	ЗагрузитьСписокВрачей();
	Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборВремениПосещения;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокВрачей()
	ТЗ=РаботаСРасписанием.ПолучитьСписокВрачейПоДатеИСпециализации(Объект.Пациент.Поликлиника,Специализация,ВыбДата);
	Если ТЗ.Количество()=0 тогда
		ИсторияПосещений.Очистить();
	Иначе
		ИсторияПосещений.Загрузить(ТЗ);	
	КонецЕсли;
	ТекНомерВрача=1;
	ВывестиВрачей(,Истина);
КонецПроцедуры

&НаКлиенте
Процедура КакМожноРаньше(Команда)
	ЗагрузитьСписокБлижайшихВрачей();
	Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборВремениПосещения;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокБлижайшихВрачей()
	ТЗ=РаботаСРасписанием.ПолучитьСписокБлижайшихВрачейПоСпециализации(Объект.Пациент.Поликлиника,Специализация);
	Если ТЗ.Количество()=0 тогда
		ИсторияПосещений.Очистить();
	Иначе
		ИсторияПосещений.Загрузить(ТЗ);	
	КонецЕсли;
	ТекНомерВрача=1;
	ВывестиВрачей(,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьЗапись(Команда)
	ДатаДляСозданияПриема=ДатаПриема+(ВремяПриема-НачалоДня(ВремяПриема));
	Попытка
		РаботаСЗаписьюНаПрием.ЗаписатьНаПрием(Объект.Пациент,ДатаДляСозданияПриема,Врач,Объект.Поликлиника,Кабинет);
	Исключение
		ПоказатьПредупреждение(,ОписаниеОшибки());
		возврат;
	КонецПопытки;
	Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.УспешнаяЗапись;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьсяЕще(Команда)
	Объект.Пациент="";
	Объект.Поликлиника="";
	Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.Авторизация;
КонецПроцедуры

&НаКлиенте
Процедура ВыберитеВрача(Команда)
	Если Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ПослеВыбораСпециализации тогда
		ЗагрузитьВрачейПоСпециализации();
		Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборВрачаПоСпециализации;
	Иначе
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВрачейПоСпециализации()
	ТЗ=РаботаСРасписанием.ПолучитьВрачейПоСпециализации(Объект.Поликлиника,Специализация);
	Если ТЗ.Количество()=0 тогда
		ИсторияПосещений.Очистить();
		Возврат;	
	КонецЕсли;
	ИсторияПосещений.Загрузить(ТЗ);
	ТекНомерВрача=1;
	ВывестиВрачей(,Истина);
КонецПроцедуры


&НаКлиенте
Процедура СписокДат1ПриАктивизацииЯчейки(Элемент)
	Элементы.СписокДат1.ВыделенныеСтроки.Очистить();
КонецПроцедуры


&НаКлиенте
Процедура СписокДат2Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ВыбДата=Элементы.СписокДат2.ТекущиеДанные.Дата;
	ДатаПриема=ВыбДата;
	ЗагрузитьСписокВременВрача();
	Элементы.РабочиеЭкраны.ТекущаяСтраница=Элементы.ВыборВремениПосещения;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокВременВрача()
	ТЗ=РаботаСРасписанием.ПолучитьВремяПриемаВрачаНаДату(Объект.Поликлиника,Врач,ДатаПриема);
	Если ТЗ.Количество()=0 тогда
		ИсторияПосещений.Очистить();
	Иначе
		ИсторияПосещений.Загрузить(ТЗ);	
	КонецЕсли;
	ТекНомерВрача=1;
	ВывестиВрачей(,Истина);
КонецПроцедуры

