
Функция ОтправитьПисьмо(ЭлектроннаяПочта, ТемаПисьма, ТекстПисьма) Экспорт
	
	Профиль1 = новый ИнтернетПочтовыйПрофиль;
	Профиль1.ИспользоватьSSLSMTP = Истина;
	
	Профиль1.АдресСервераSMTP = "smtp.mail.ru";
	Профиль1.ПользовательSMTP = "nexthackathon";
	Профиль1.Пользователь = "nexthackathon";
	Профиль1.ПарольSMTP = "123456next";
	Профиль1.Пароль = "123456next";
	Профиль1.ПортSMTP = 465; 
	
	ПРофиль1.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	Отправитель1 = "nexthackathon@mail.ru";   
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.ИмяОтправителя = Отправитель1;
	Сообщение.Отправитель = Отправитель1;
	Сообщение.Тема = ТемаПисьма;
	Сообщение.Получатели.Добавить(ЭлектроннаяПочта);
	Сообщение.Тексты.Добавить(ТекстПисьма);
	
	Почта = Новый ИнтернетПочта;
	Почта.Подключиться(Профиль1);
	Почта.Послать(Сообщение);	
	
КонецФункции