
// 

Функция ЗаписатьНаПрием(Пациент, ДатаПриема, Врач, Поликлиника, Кабинет) Экспорт
	
	НачатьТранзакцию();
	
	Прием = Документы.Прием.СоздатьДокумент();
	Прием.Дата = ТекущаяДата();
	Прием.Пациент = Пациент;
	Прием.Поликлиника = Поликлиника;
	Прием.ДатаПриема = ДатаПриема;
	Прием.Врач = Врач;
	Прием.Кабинет = Кабинет;
	Прием.Записать(РежимЗаписиДокумента.Проведение);
	
	ЗаписьГрафика = РегистрыСведений.ГрафикиПриема.СоздатьМенеджерЗаписи();
	ЗаписьГрафика.Поликлиника = Поликлиника;
	ЗаписьГрафика.Врач = Врач;
	Если ЗначениеЗаполнено(Кабинет) Тогда
		ЗаписьГрафика.Кабинет = Кабинет;
	КонецЕсли; 
	ЗаписьГрафика.Дата = НачалоДня(ДатаПриема);
	ЗаписьГрафика.Время = ДатаПриема; // Предполагаю что время скопируется
	ЗаписьГрафика.Прочитать();
	Если Не ЗаписьГрафика.Выбран() Тогда
		ВызватьИсключение "Запись на прием с указанными параметрами невозможна";
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗаписьГрафика.Прием) Тогда
		ВызватьИсключение "Запись на прием с указанными параметрами уже занята";
	КонецЕсли;
	ЗаписьГрафика.Прием = Прием.Ссылка;
	ЗаписьГрафика.Записать();
		
	ЗафиксироватьТранзакцию();
	
	Возврат Прием.Ссылка;
	
КонецФункции

Функция  СоздатьПожеланиеНаПрием(Пациент, Врач, Поликлиника) Экспорт
	
	ПожеланиеНаПрием = Документы.ПожеланиеНаПрием.СоздатьДокумент();
	ПожеланиеНаПрием.Пациент = Пациент;
	ПожеланиеНаПрием.Поликлиника = Поликлиника;
	ПожеланиеНаПрием.Врач = Врач;
	ПожеланиеНаПрием.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ПожеланиеНаПрием.Ссылка;
	
КонецФункции

Функция ПолучитьСписокСпециализаций() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Специализации.Ссылка КАК Специализация
	               |ИЗ
	               |	Справочник.Специализации КАК Специализации
	               |ГДЕ
	               |	НЕ Специализации.ПометкаУдаления";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Специализация");
	
КонецФункции


